{"pageProps":{"posts":[{"slug":"모각소020250705","title":"아주대 모각소 2025 하계 - test","date":"2025-07-05","content":"## test\r\n\r\ntest입니다.","excerpt":"## test\r\n\r\ntest입니다."},{"slug":"RVCWebUI동영상제작과제20240302","title":"RVC WebUI - AI 음성 변조 오픈소스 프로젝트 사용방법 소개 (학교 동영상 제작 과제)","date":"2024-03-03","content":"학교의 과목 중 하나의 과제가 소프트웨어 툴에 대해서 소개하는 자유 주제 과제였다.\r\n그래서 관심있었던 프로그램이지만 사용법을 잘 몰랐던 것을 주제로, A+을 목표로 영상을 만들었다.\r\n\r\n그 주제가 바로 음성을 다른 캐릭터 모델의 음성으로 바꿀 수 있는 [RVC-WebUI](https://github.com/RVC-Project/Retrieval-based-Voice-Conversion-WebUI)다.\r\n본래 [이것](https://github.com/w-okada/voice-changer)으로 하려고 했으나 이것은 실시간 음성 변환만 들어있기에 분량이 부족했기에, RVC-WebUI로 하게 된 것이다.\r\n\r\nRVC-WebUI는 실시간 음성 변환도 있고, 오디오 파일 음성 변환도 있고, 반주와 보컬 음성 분리도 가능하며, 모델을 학습시키는 것도 가능하다. 그리고 애초에 [w-okada의 voice-changer](https://github.com/w-okada/voice-changer)가 RVC-WebUI를 기반으로 하는지, RVC-WebUI로 향하는 링크가 README.md에 있었기에 이것으로 하게 되었다.\r\n\r\n1편\r\n<Video\r\n\tvideoSrcURL=\"https://www.youtube.com/embed/9z2Q9Zep07Y?si=Glur13kbw5HK9UXt\"\r\n\tvideoTitle=\"[SWTT] RVC-WebUI를 활용해서 목소리 변조, 반주와 보컬 분리, 실시간 목소리 변조, RVC 모델 생성해보기 (1/2)\"\r\n/>\r\n\r\n2편\r\n<Video\r\n\tvideoSrcURL=\"https://www.youtube.com/embed/KeuU9kQGoH8?si=J0gurWGG-mLhX2xI\"\r\n\tvideoTitle=\"[SWTT] RVC-WebUI를 활용해서 목소리 변조, 반주와 보컬 분리, 실시간 목소리 변조, RVC 모델 생성해보기 (2/2)\"\r\n/>\r\n\r\n이 과정에서 저작권 만료된 음악과 저작권 없는 음성 모델을 찾느라 시간을 많이 썼다.\r\n오히려 프로그램 소개와 영상 편집은 쉬웠던 것 같다.\r\n\r\n그렇게 A+과 간단한 영상 편집 능력을 얻었다고 한다..","excerpt":"학교의 과목 중 하나의 과제가 소프트웨어 툴에 대해서 소개하는 자유 주제 과제였다.\r\n그래서 관심있었던 프로그램이지만 사용법을 잘 몰랐던 것을 주제로, A+을 목표로 영상을 만들었다.\r\n\r\n그 주제가 바로 음성을 다른 캐릭터 모델의 음성으로 바꿀 수 있는 [RVC-We..."},{"slug":"포함시키고싶지않은테스트용디렉토리를gitignore에넣기20240302","title":"포함시키고 싶지 않은 테스트용 디렉토리를 gitignore에 넣기","date":"2024-03-02","content":"뭔가 android 라는 폴더 안에 안드로이드 관련 인증키인 test.jks랑 관련 비밀번호들을 넣어서 관리하고싶다 가정해보자. 다른 곳에 인증서들을 두면 잊어버릴 것 같고, 편하게 쓰려고 그랬다고 쳐보자.\r\n근데 이거는 오픈소스 프로젝트(혹은 git으로 관리되는 레포지토리)고, jks는 인터넷에 공개되면 안된다.\r\n\r\n그냥 최상위 .gitignore에 추가하면 이렇게 추가하면 될 것이다.\r\n```\r\nandroid/test.jks\r\n```\r\n\r\n그러면 gitignore에 추가하면 되는데, 만약 유출되면 안되는 정보 같은 것이 계속 늘어날 수 있고, 한 폴더를 그냥 제외하는 것이 편할 것이다.\r\n```\r\nandroid/keystore\r\n```\r\n\r\n\r\n앗 근데 이것을 다른 이들과 공유할 필요가 없고, 팀원들이 .gitignore에 추가된 의문의 폴더에 대해 보게될 수도 있다. .gitignore에도 남기고 싶지 않은데 어떻게 해야할까 그러면?\r\n그러면 아예 android/keystore 에다가 .gitignore를 만들고 다음과 같이 적어주면 된다.\r\n```\r\n*\r\n```\r\n*은 Global, 전부 다.\r\n.gitignore는 .gitignore도 넣을 수 있어서, 그냥 이거는 git의 관리 대상에서 제외되어서 더 이상 staging 되지 않는다.\r\n이러면 팀원들에게 내 사적인(?) 인증파일 등을 보일 필요도 없고, 온 세상의 해커들에게 내 인증파일을 보여줄 일도 없을 것이다.","excerpt":"뭔가 android 라는 폴더 안에 안드로이드 관련 인증키인 test.jks랑 관련 비밀번호들을 넣어서 관리하고싶다 가정해보자. 다른 곳에 인증서들을 두면 잊어버릴 것 같고, 편하게 쓰려고 그랬다고 쳐보자.\r\n근데 이거는 오픈소스 프로젝트(혹은 git으로 관리되는 레포..."},{"slug":"모각소5안드로이드버전강제업데이트도전및OpenAISora20240226","title":"아주대 모각소 5일차 -  안드로이드 버전 강제 업데이트 도전(미완) 및 OpenAI Sora","date":"2024-02-16","content":"## 안드로이드 버전 강제 업데이트 도전 (미완)\r\n\r\n친척이 더 좋은 태블릿pc가 생겨서, 기존에 갖고 계셨던 보급형 Lenovo A8 태블릿을 버리게 되어, 통학 시간 등에 공부나 영상 시청에 활용하고자 그걸 받아와서 사용하려고 공장 초기화를 하였다.\r\n\r\n근데 공장 초기화를 했더니 안드로이드 5.2 버전이 되어있는 것이 아닌가? (현재 버전 14)\r\n\r\n그래서 유튜브도 가능한 업데이트가 더 이상 없어 작동이 안되고, 구버전 크롬을 사용해 사이트에 들어가면 아예 깨져서 html 로만 보이는 곳도 많았다. 그리고 설치가 불가한 앱들도 많았다. (안드로이드 SDK 버전이 높아지면 개발자가 넣을 수 있는 기능도 많아지는데, 그러한 기능을 넣게 되면 그 이하 버전에서는 앱을 설치할 수 없다. 그렇기에 구형기기에서는 요즘 모바일 앱들이 거의 설치가 불가능해진 것이다.)\r\n\r\n이 상태로는 사용 불가로 생각되어 레노버에서 만든 시스템 업데이트를 사용하려고 했으나, 이것 또한 지원 중단.\r\n\r\n그저 운영체제 버전이 낮기 때문에 램 4gb되는 그래도 쓸만한 태블릿을 두고, 비슷한 사양의 보급형 태블릿을 새로 사는 것은 상당히 아쉬운 일이었다.\r\n\r\n그래서 아예 안드로이드 버전이 높은 것을 새로 깔아버리면 되지 않는가 하는 생각에 찾아보았더니, [LineageOS](https://namu.wiki/w/LineageOS)라는 것이 있었다.\r\n\r\n시간날 때마다 [이 글](https://pathlite.kr/174)과 외국인 유튜버의 영상이나 [글](https://www.getdroidtips.com/lineage-os-14-1-lenovo-tab-a8-50/)을 보며 시도했으나, 공장 초기화만 여러번 될 뿐 아직 성공해보진 못했다.\r\n\r\n현재 갖고있는 태블릿에서 여러 버튼을 조합해도 fastmode로 가는 것이 안되어서, 안드로이드에서 개발자모드로 한 후 디버깅을 허용한고 OEM모드를 허용한 후에 pc에 연결한다. 이후 adb 명령어를 사용해 안드로이드 태블릿이 fastmode로 가게 하고, 거기서 fastboot 명령어를 사용해 twrp로 진입하면 되는데… 여기서 안된다.\r\n\r\n한번 이 twrp에 진입하는 것을 목표로 다른 글을 찾아봐야할 것 같다.\r\n\r\n## OpenAI Sora\r\n\r\n<Video\r\n  videoSrcURL=\"https://www.youtube.com/embed/HK6y8DAPN_0?si=uo8ULsDvL8N8q1nB\"\r\n  videoTitle=\"Introducing Sora — OpenAI\\'s text-to-video model\"\r\n/>\r\n\r\n최근 OpenAI에서 DALL-E 를 기반으로 한, 영상을 생성해주는 AI인 [Sora](https://openai.com/sora)가 상당히 hot한 것 같다.\r\n뭔가 아직 써볼 수는 없는 것 같지만, 예시로 본 동영상은 무척 놀라웠다.\r\n\r\n영화의 짧은 장면이나, 배경하고 엑스트라를 그냥 이걸로 대체해서 만들어도 어색하지 않을만한 퀄리티였다.\r\n\r\n이런 영상들을 막 만들어서, 빠르게 선택형 게임 하나를 만들 수 있지 않을까 생각도 들었다.\r\n\r\n영상을 생성하는 AI는 예전에 이미 나왔었지만, 퀄리티가 전부 뭔가 이상했다. 근데 이번에 OpenAI의 Sora가 영상을 퀄리티를 높게 뽑아낸 것을 보고 감탄할 수 밖에 없었다.\r\n\r\n항상 신기술이 나오면 한계가 보인다.\r\n\r\n근데 그 한계에 대응해 빠르게 여러 기술이 나오고, 그걸 발전시키거나 융합해서 서비스화 해버리는 이 시대가 놀라운 것 같다.","excerpt":"## 안드로이드 버전 강제 업데이트 도전 (미완)\r\n\r\n친척이 더 좋은 태블릿pc가 생겨서, 기존에 갖고 계셨던 보급형 Lenovo A8 태블릿을 버리게 되어, 통학 시간 등에 공부나 영상 시청에 활용하고자 그걸 받아와서 사용하려고 공장 초기화를 하였다.\r\n\r\n근데 공..."},{"slug":"모각소4모바일앱OneSignalPush우선순위20240208","title":"아주대 모각소 4일차 - 모바일 앱 푸시 알람에도 우선순위가 있다","date":"2024-02-08","content":"군에 가기 전부터 지금까지 가족의 요청으로 모바일 웹뷰 앱 관련해서 일을 가끔 하고 있다.\r\n군에 가기 전에는 React Native Expo로 직접 웹뷰 앱을 개발하서 사용하였었는데, 군에 있는 동안 React Native Expo의 체계가 상당히 많이 바뀌어서 기존 코드로는 앱을 빌드할 수 없는 상황이 되어버렸다. 그래서 내가 군에 있는 동안 다른 웹뷰 프레임워크를 도입하게 되었다고 한다.\r\n그래서 전역 후, 그 새로운 웹뷰 프레임워크에 맞춰서 모바일 앱을 출시하게 되었다.\r\n\r\n그렇게 활용되고 있는 모바일 웹뷰 앱 중 하나가 푸시 알림을 적극 활용하는데, 그 푸시 알림이 일정하지 않게 사람들에게 도착한다하여 문제가 되었다.\r\n예전에 개발했던 방식이 구글 firebase와 Apple 푸시 관련 서비스에 직접 푸시 알림을 요청했었는데, 이번에는 OneSignal 이라는 푸시를 더 간편하게 보낼 수 있는 서비스를 활용하게 되었다. 안드로이드랑 애플 쪽 푸시 알림을 OneSignal이 중계해서 더 쉽게 한방에 보내주는 듯한 서비스다.\r\n\r\n근데 그렇게 해놓으니 푸시 도착하는 시간이 휴대폰마다 제각각 다른 것이 아닌가?\r\n그래서 이번 모각소 시간에 한번 찾아보았다.\r\n\r\n그래서 일단 [OneSignal Delayed](https://documentation.onesignal.com/docs/notifications-delayed) 공식 문서에 가서 보았더니, 이유가 될만한 것이 상당히 많았다.\r\n첫째, 받는 사람의 네트워크 문제일 수가 있다.\r\n둘째, 자주 사용하지 않는 앱이라 알림 권한이 삭제된 것일 수도 있다.\r\n셋째, 푸시 알람의 우선순위가 문제일 수도 있다.\r\n등등.. 여러 이유가 있어 하나하나 살펴보았다.\r\n\r\n먼저 네트워크 문제를 확인하기 위해 같은 네트워크 상에 있는 휴대폰들에 앱을 설치하고 알림 권한도 허용하고 푸시를 날려본 결과, 푸시 알림이 거의 잘 도착했지만 한 사람 휴대폰에서는 푸시 알림이 울리지 않았다.\r\n그래서 그 휴대폰 해당 모바일 앱 권한을 확인해봤는데 권한이 허용되어있었다.\r\n게다가 그 모바일 앱은 출시한지 6개월이 되지 않았다. (앱을 사용을 몇개월 동안 안해야 권한이 삭제된다고 한다.)\r\n\r\n그래서 우선순위인 것 같아서 이곳 저곳 영어로도 검색해보기도 한 결과 뭔가 푸시 알림에 우선순위의 속성이 있는 것이 확실해졌다.\r\n\r\n현재 푸시 알람을 보내는 방식이, 따로 제작한 관리자 웹사이지에서 OneSignal API로 OneSignal에다가 어떤 알림을 보낼지 날려서, 다시 OneSignal에서 구글과 애플 알림 관련 서비스에 날리고, 거기서 다시 모바일 앱으로 알림을 보내주는 방식이다.\r\n\r\n바로 우리의 관리자 웹페이지에서 OneSiganl API로 보내는 코드에, 다음과 같이 priority 속성을 넣어주었다.\r\n\r\n```json\r\n{\r\n  \"app_id\": \"YOUR_APP_ID\",\r\n  \"included_segments\": [\"All\"],\r\n  ... 중략 ...\r\n  \"priority\": 10\r\n}\r\n```\r\n\r\n그러니 푸시 알림이 모든 휴대폰에 바로바로 가기 시작했다.\r\n\r\n아마 채팅 기능을 만드는 등 신속한 푸시 알림이 필요하면, 이 우선순위 속성을 알고있어야 할 것이다.","excerpt":"군에 가기 전부터 지금까지 가족의 요청으로 모바일 웹뷰 앱 관련해서 일을 가끔 하고 있다.\r\n군에 가기 전에는 React Native Expo로 직접 웹뷰 앱을 개발하서 사용하였었는데, 군에 있는 동안 React Native Expo의 체계가 상당히 많이 바뀌어서 기존..."},{"slug":"모각소3서블렛만능함수20240204","title":"아주대 모각소 3일차 - 만든 함수가 만능 함수가 아닐 경우","date":"2024-02-04","content":"![스크린샷1](./screenshot1.png)\r\n저번에 위 사진과 같이 방이 중복되어서 나오는 문제가 있었다.\r\n그래서 useEffect가 strict 모드에서 두번 렌더링 한다는 것을 의심했었고, 프로덕트로 빌드하고 크롬으로 파일을 직접 열어보았더니 아래와 같은 오류가 나왔었다.\r\n\r\n![스크린샷2](./screenshot2.png)\r\n\r\n그래서 검색해보니 해당 프로덕트용 코드를 서버 프로그램으로 올려주면, 접속이 된다 하였다.\r\n\r\n```bash\r\nnpm install -g serve\r\nserve -s build\r\n```\r\n\r\n그래서 뭔가 이런 식으로 했더니 프로덕트용 코드를 열 수 있었다.\r\n하지만 여전히 방이 중복되어서 나오는 것이 아닌가?\r\n\r\n그래서 코드의 로직을 약간 바꿨다.\r\n방 더 불러오기 버튼을 눌렀을 때 이미 사전에 불러와져있던 방 정보를 화면에 표시하고, 동시에 그 다음 방 정보들을 사전에 저장시켜놓는데.\r\n이 방 더 불러오기 로직을 그대로 웹페이지가 시작될 때 방 불러오는 용도로 두번 정도 사용해버리니, 뭔가 문제가 있었나 싶다.\r\n그래서 아예 개별적으로 방 정보만 불러오고, 그 다음 방 정보를 저장하도록 분리했더니 방 중복 없이 정상 작동하였다.","excerpt":"![스크린샷1](./screenshot1.png)\r\n저번에 위 사진과 같이 방이 중복되어서 나오는 문제가 있었다.\r\n그래서 useEffect가 strict 모드에서 두번 렌더링 한다는 것을 의심했었고, 프로덕트로 빌드하고 크롬으로 파일을 직접 열어보았더니 아래와 같은 ..."},{"slug":"모각소2서블렛useeffect20240127","title":"아주대 모각소 2일차 - useEffect는 2번 렌더링을 한다. & 잡다","date":"2024-01-28","content":"글 게시물이 나오도록 코드를 짠 부분에서, 게시물이 중복되어서 나온다는 현상이 발생되었다.\r\n\r\n글 게시물을 여러개 나오도록 하는 것에 초점을 맞춰 만들어서, 중복되는지 몰랐는데 운 좋게 팀원이 발견해주었다.\r\n\r\n![스크린샷1](./screenshot1.png)\r\n\r\n현재 db 상에 방 게시물 데이터가 4개 밖에 안 올렸는데, 아래에 방 더보기 버튼이 생겨서 눌러보았더니,\r\n\r\n![스크린샷2](./screenshot2.png)\r\n\r\n이렇게 똑같은 방이 또 떠버린다.\r\n왜 그런 것인가?\r\n\r\n처음에 방 정보가 없을 때에도 방을 불러올 수 있도록 useEffect에서 방 정보를 가져오는 코드를 넣어놓았었다.\r\n그래서 데이터를 살펴보기 위해 useEffect 안에 console.log 로 찍어보니, console.log 여러번 수행이 되는 것을 확인할 수 있었다.\r\n\r\n![스크린샷3](./screenshot3.png)\r\n\r\n뭔가 이상한 듯 하여 인터넷에 \"리액트 useEffect 2번 돌아감\" 이런 느낌으로 검색해보니 strict 모드를 했을 때, 리액트 개발 모드로 돌려서 보면 useEffect가 여러번 호출된다는 것이다.\r\n\r\n그래서 `npm start`가 아닌, `npm run build`로 돌린 후 index.html로 확인해보았다.\r\n\r\n근데 아무 화면도 안 떠서 왜 그런가 확인해보았더니, npm run build는 서버에 올라가는 것을 가정하여 \"/\"를 경로로 하기 때문이라고 그런다. [(참고 글)](https://nuucolog.tistory.com/26)\r\n그래서 [다른 글](https://stackoverflow.com/questions/43011207/using-homepage-in-package-json-without-messing-up-paths-for-localhost)과 [문서](https://create-react-app.dev/docs/deployment/)도 한번 슬쩍 보면서 상대 경로인 \".\"로 바꿔주었다.\r\n\r\n그런데도 안된다.\r\n그래서 콘솔창을 열어보니 다음과 같은 것이 뜨는데..\r\n\r\n![스크린샷4](./screenshot4.png)\r\n\r\n해결책을 찾고 다음 포스트에 이어서 하겠다.","excerpt":"글 게시물이 나오도록 코드를 짠 부분에서, 게시물이 중복되어서 나온다는 현상이 발생되었다.\r\n\r\n글 게시물을 여러개 나오도록 하는 것에 초점을 맞춰 만들어서, 중복되는지 몰랐는데 운 좋게 팀원이 발견해주었다.\r\n\r\n![스크린샷1](./screenshot1.png)\r\n\r..."},{"slug":"모각소1서블렛useeffect20240121","title":"아주대 모각소 1일차 - useEffect에서 fetch 사용을 하려면 async 사용하기","date":"2024-01-21","content":"최근 참여하고 있는 프로젝트에서 React로 방 정보를 불러와서 뛰어주는 메인 페이지를 만들어야 하는 일이 있다.\r\n백엔드 만들어주시는 분이 api 방식으로 간단하게 방 정보들 가져올 수 있도록 해주셔서 그걸 적극 활용하였다.\r\n생각나는대로 api가 가져오는 정보를 기존 방 정보랑 결합해주도록 하는 더보기 버튼을 만드니, 계속해서 방 리스트를 가져올 수가 있었다.\r\n그리고 현재 띄어주는 것과 별개로 미리 다음 방 정보를 가져오는 것이 좋겠다고 같이 모각코를 진행중인 분이 말해주었었는데, 확실히 그렇게하니 더 불러올 방이 있으면 버튼이 활성화되고 없으면 비활성화 되는 기능을 구현하기 쉬웠다.\r\n\r\n일단 이런 식으로 생각나는 대로 기능을 구현했더니, 그대로 바로 동작했다.\r\n그래서 바로 commit 하고 GitHub로 push하였으나.. 여기서 문제가 발생했다.\r\n\r\n![스크린샷1](./screenshot1.png)\r\n그냥 이렇게 떠버리는 것이 아닌가?\r\n\r\n![스크린샷2](./screenshot2.png)\r\n버튼을 한번 눌러주어야 내가 기대한 최초의 화면이 나와버린다\r\n최초 실행 시에도 방 정보를 받아와야 하는데, 버튼을 눌러야 방 정보가 나오는 불친절한 사이트가 되어버린 것이다!\r\n\r\n문제의 코드는 바로 이랬다.\r\n\r\n```js\r\nuseEffect(() => {\r\n  fetchRooms(listRoomAmount, listPageAmount);\r\n}, []);\r\n```\r\n\r\nfetch해서 받아온 데이터가 채워져있을 변수를 console.log로 찍어봤더니, 아무것도 없었다.\r\n분명 최초 실행 시에도 방 정보를 받아와야 하는데, 받아오지 못하는 것이다.\r\n![스크린샷3](./screenshot3.png)\r\n\r\n그래서 일단 머리를 스친 것은, useEffect가 제때 정보를 못 받아 온 것을 그냥 무시해버리고 있다는 느낌이었다.\r\n과거 react-native 웹뷰 관련 프로젝트를 할 때, gps 정보를 가져온 후에 웹페이지에 있는 js코드를 실행해야 했는데, 이 개념을 잘 몰라서 많이 헤맨적이 있었다.\r\n또한 저번 학기 운영체제 시간에 언급했던 프로젝트 때문에 관심을 가지게 된 동기, 비동기와 관련된 문제인 것 같아 어떻게 검색해서 정보를 알아볼 지 감이 잡혔다.\r\n동기화는 아예 작업을 순차적으로 해버리기 때문에 블록킹 방식과 같다 볼 수 있고, 논블록킹 방식은 작업이 끝날 때까지 기다리지 않는다고 들었었다.\r\n그러면 지금 useEffect는 논블로킹으로 작동 하고있는 것인가? 그래서 바로 구글에 리액트 useEffect 동기화라는 키워드로 검색해보았다.\r\n근데 검색해보니 async, 비동기를 사용하라고 한다.\r\n생각해보면 지금 방 정보를 얻어오는 api에다가 fetch 함수로 데이터를 가져오고 있는데, 당연히 동기나 비동기로 가져와야 했다.\r\n근데 동기화를 하기엔 데이터 받아올 때까지 사용자의 웹페이지가 멈춰있을 수는 없지 않은가?\r\n그래서 비동기로 동작하는 것이 당연한 것이 아닌가 나름대로 생각하며 바로 useEffect에서 async를 사용해버렸다.\r\n\r\n```js\r\nuseEffect(() => {\r\n  async function fetchData() {\r\n    const res = await fetch(\r\n      process.env.REACT_APP_BACKEND_URL +\r\n        \"/post\" +\r\n        `?maxPost=${listRoomAmount}&page=${listPageAmount}`\r\n    );\r\n    const data = await res.json();\r\n    setPreRoomsData(data);\r\n    setRoomsData([...roomsData, ...data]);\r\n  }\r\n  fetchData();\r\n}, []);\r\n```\r\n\r\n![스크린샷4](./screenshot4.png)\r\n\r\n그러니 잘 동작한다.","excerpt":"최근 참여하고 있는 프로젝트에서 React로 방 정보를 불러와서 뛰어주는 메인 페이지를 만들어야 하는 일이 있다.\r\n백엔드 만들어주시는 분이 api 방식으로 간단하게 방 정보들 가져올 수 있도록 해주셔서 그걸 적극 활용하였다.\r\n생각나는대로 api가 가져오는 정보를 기..."},{"slug":"미지의오류를최소화시키는법20230802","title":"미지의 오류를 최소화시키는 법","date":"2023-08-02","content":"뭔가 소프트웨어를 만들다보면 \"경유\"해야 하는 것들이 생긴다.\r\n예를 들면 프론트에서 서버 사이드 웹서버로 정보를 요청하지만, 사실은 DB의 데이터를 얻어오는 것 같은 것이 될 수 있다.\r\n\r\n최근 만든 잘 작동하던 모바일 앱이 갑자기 아무런 수정없이도, 푸시가 안되는 문제가 발생했었다.\r\n\r\n아예 OneSignal에서 내 휴대폰에서 작동하는 앱들을 감지하지 못하는 문제가 발생했었기에, 문제점을 여러 곳에서 찾아보기 시작했다.\r\n\r\n일단 그 모바일 앱은 마침 크로스 플랫폼 프레임워크 + 네이티브 코드로 만들어져 있었기에, js와 java와 object-c를 다 살펴보았다.\r\n\r\n근데 또 그 모바일 앱을 수정하는 파이썬 자체 프로그램을 쓰고 있었기에, 그 코드 또한 살펴보아야 했다.\r\n\r\n또 그것이 그냥 firebase 같은 곳에서 푸시 알림을 처리하는 것이 아니라, OneSignal 이라는 서비스를 경유하여 푸시를 처리하는 것이었다.\r\n그래서 그것 또한 OneSignal에서 발생한 문제인지 firebase에서 발생한 문제인지 알아보아야 했다. (+ iOS도 작동이 안되었기에 firebase의 문제는 아니었을 것이다.)\r\n\r\n근데 또 같은 환경으로 만든 앱은 잘 작동하는 것이 아닌가?\r\n\r\n근데 한 6시간 동안 이유를 찾아보다가, 갑자기 그냥 푸시가 작동하고, OneSignal에서 내가 조작한 앱의 기록들이 나왔다.\r\n\r\n푸시도 안되고, 앱 알림 구독 유무도 절대 안나오다가 6시간 후에서야 한방에 나왔다.\r\n\r\n\r\n여기저기 다 들쑤시고 다녔지만, 결국 OneSignal 혼자 만의 문제였던 것이다.\r\n\r\n이것 저것을 섞어서 쓰면 오히려 어디서 문제가 발생한지 파악하기가 힘들어지므로, 최대한 간단한 구조로 만들어 디버깅을 쉽게하는 것이 좋은 방법인 것 같다.\r\n\r\n(+남이 만들어놓은 인프라나 라이브러리 등에 대해서는 직접적인 디버깅이 힘드므로, 최대한 신뢰도 높은 것을 사용해야 할 듯 하다.)","excerpt":"뭔가 소프트웨어를 만들다보면 \"경유\"해야 하는 것들이 생긴다.\r\n예를 들면 프론트에서 서버 사이드 웹서버로 정보를 요청하지만, 사실은 DB의 데이터를 얻어오는 것 같은 것이 될 수 있다.\r\n\r\n최근 만든 잘 작동하던 모바일 앱이 갑자기 아무런 수정없이도, 푸시가 안되는..."},{"slug":"너무늦게알게된것20230220","title":"너무 늦게 알게 된 것","date":"2023-02-20","content":"나는 IT 특성화 실업계 고등학교에 진학했었다.\r\n거기서 1학년 때 Visual Studio로 C언어를 처음 배웠었는데, 그때 빌드하는 것을 Ctrl+F5? 라고 배웠었다.\r\n\r\n그때 F5를 눌러도 비슷하게 되긴하는데 구동하는게 너무 많이 느려서 관심을 별로 안 가졌기도 했고, 누군가 딱히 알려주지도 않았다.\r\n\r\n이후로도 다른 언어를 인터넷 등을 통해 처음부터 공부할 때도 딱히 디버거에 대한 언급은 딱히 없었던 것 같고, 직접 사용할 때도 거의 그런식으로 바로 빌드하면서 코딩을 해왔다.\r\n\r\n나는 디버그라는 것을 그냥 버그를 고치는 행위라고만 2017년부터 알고있었으나, 막상 디버깅 툴을 써본 적은 없었다.\r\n\r\n그러다가 궁금해서 며칠 전에 처음으로 써보았는데.... 이걸 왜 지금 알았지.\r\n\r\nprint나 log 등으로 변수 값이나 계산 값 등을 찍으면서 프로그램이 어떻게 돌아가는지 파악하던 과거의 행위는 엄청난 시간낭비였다.\r\n\r\n이 훌륭한 것을 지금 알다니..\r\n\r\n이것에 관심을 많이 가지지 않았었던 것에 대해 반성합니다.\r\n\r\n\r\n만약 내가 누군가에게 프로그래밍에 대해 알려주는 기회가 생긴다면, 반복문 알려줄 때부터는 디버깅 툴의 존재를 알려주며, 파악하기 어려운 흐름이 있을 때 사용하라고 할 것이다.","excerpt":"나는 IT 특성화 실업계 고등학교에 진학했었다.\r\n거기서 1학년 때 Visual Studio로 C언어를 처음 배웠었는데, 그때 빌드하는 것을 Ctrl+F5? 라고 배웠었다.\r\n\r\n그때 F5를 눌러도 비슷하게 되긴하는데 구동하는게 너무 많이 느려서 관심을 별로 안 가졌기..."},{"slug":"사람들은자신의가치가없다느낄때절망하는가20230217","title":"사람들은 자신의 가치가 없다 느낄 때 절망하는가?","date":"2023-02-17","content":"갑자기 든 생각인데, 사람은 자신의 가치가 없다고 느낄 때 울적함을 느끼는 것 같다.\r\n\r\n나이가 높아질수록 자살률이 높아지는 이유[1](https://www.mohw.go.kr/react/al/sal0301vw.jsp?PAR_MENU_ID=04&MENU_ID=0403&page=1&CONT_SEQ=373035)나 요즘 늘어난 청년 자살[2](https://www.yna.co.kr/view/AKR20220411106900005)도 그와 같지 않은가 싶다.\r\n\r\n그러한 울적함을 없애기 위해서는 어떻게 해야하는가?\r\n\r\n나는 그러기 위해서는 무언가를 끊임없이 해야한다고 생각한다.\r\n남이 어떻게 생각하던 상관없이, 자기자신을 단련시키며 무엇이라도 실력을 향상시키며 즐기며 수련하는 것이, 결국 \r\n\r\n그렇기에 취미가 좋은 것이다.\r\n취미는 해당 분야의 실력을 향상시키는 것이고, 그것으로 인해 다른 것으로도 나아갈 수 있는 자신감을 줄 수 있다.\r\n\r\n이건 사회적으로 성공하는가 아닌가의 문제가 아니라, 사람이 온전한 정신으로 살아가기 위해서 필요한 것이다.\r\n\r\n물론 자기자신의 본업의 실력을 향상시키는 것이 직접적인 삶에 도움이 되므로 방해가 없는(?) 진정한 행복을 얻게 될 수 있을 것이다.","excerpt":"갑자기 든 생각인데, 사람은 자신의 가치가 없다고 느낄 때 울적함을 느끼는 것 같다.\r\n\r\n나이가 높아질수록 자살률이 높아지는 이유[1](https://www.mohw.go.kr/react/al/sal0301vw.jsp?PAR_MENU_ID=04&MENU_ID=0403..."},{"slug":"기다리다발견20230209","title":"기다리다 발견","date":"2023-02-09","content":"FastAPI랑 discord 파이썬 관련된 것 있나 GitHub 좀 찾아보다가, 옛날 고등학교 때 대회를 나갔다가 잠시 생긴 Organization가 있길래 한번 봐보다가 한 프로필이 눈에 띄었다.\r\n\r\n옛날 알던 반친구 등도 있고 아는 이름도 있었지만, 누군지 전혀 모르겠는 사람의  고양이 프로필이 상당히 눈에 들어오고 귀여워서, 한번 궁금하기도 해서 구경하고 왔다.\r\n그 프로필 너머에는 나와 같은 사나이가 있겠지만..\r\n\r\n이때 나도 의미가 딱히 없긴 하지만 프로필에 재미난 사진을 넣을까 생각이 들었다.\r\n깃허브를 2017년에 가입했는데, 프로필이 계속 비어있긴 했다.\r\n\r\n허나 사진을 인터넷에서 구해서 아무거나 올리면 도용이지 아니한가?\r\n그렇다고 내 사진을 올리기에는 마땅한 좋은 사진이 없어보였다.\r\n\r\n그래서 예전에 친구에게 찍힌 좀 웃긴 내 사진을 찾아보고 있었으나, 한 사진이 눈에 들어왔다.\r\n\r\n![시바견 인형 사진](./img_20210822_165946596.jpg)\r\n\r\n파일명을 보니 2021년 8월 22일에 찍혔기에 생각해보니, 입대 전 후배가 괜찮은 맛집을 알고 있다고 해서 가서 기다리던 중에 발견한 것이었다. 아쉽게도 맛집은 당일 휴점이었었다 ㅋㅋㅋㅋ...\r\n\r\n보면서 많은 생각이 들었다.\r\n이별한건가? 이사? 아니 근데 왜 올라가 있지\r\n\r\n![시바견 인형 사진을 뒷 배경 제거해서 프로필 적용한 사진](./profile.png)\r\n\r\n그래서 이러면서 웹서핑하고 추억을 회상하고, 이걸로 프로필 사진 바꾸고 이 글 쓰다가 무려 2시간이 사라져버렸다..\r\n\r\n犬生..\r\n\r\n---\r\n\r\n+뜬끔없지만 견생이 아닌 인생을 제대로 살려면, 아무리 시간이 없어도 최소한 10분은 책을 읽어야겠다.","excerpt":"FastAPI랑 discord 파이썬 관련된 것 있나 GitHub 좀 찾아보다가, 옛날 고등학교 때 대회를 나갔다가 잠시 생긴 Organization가 있길래 한번 봐보다가 한 프로필이 눈에 띄었다.\r\n\r\n옛날 알던 반친구 등도 있고 아는 이름도 있었지만, 누군지 전혀..."},{"slug":"새로운생산수단의점유자20230208","title":"새로운 생산 수단의 점유자","date":"2023-02-08","content":"예전에 채사장의 지대넓얕~[지적 대화를 위한 넓고 얕은 지식](http://www.yes24.com/Product/Goods/86545658)~ 이라는 책을 읽으며 인상 깊었던 것은, 생산 수단을 점유하고 있는 자가 권력을 얻는 것이었다. \r\n\r\n고대에 더 뾰족한 사냥 도구를 갖거나, 더 좋은 농기구를 가진 사람~생산 수단을 점유한 자~이 더 많은 자원을 갖게 되었고, 반면 마땅한 도구가 없어 먹을 것~자원~을 적게 생산하여 부족한 자들은 먹을 것이 많은 자들에게 얻어 먹는 과정에서 계급이 생긴다는 것이었다. 이후 중세에는 영지를 소유한 자들이, 산업 시대에는 공장을 소유한 자들이, 즉 생산 수단을 소유한 자들이 권력의 중추가 되었다고 책에서 보았다.\r\n\r\n이후 현대에 와서도 동일하긴 하다만, 급격한 인구 감소로 인해 생산~+서비스~보다 소비가 더 많아질 수도 있는 상황~인구 역피라미드~이 올 수도 있다.\r\n기존 생산 수단이 소비를 감당하지 못하게 되는 것이다.\r\n\r\n이민자를 수용하여 노동 인구를 대체하는 방안도 있지만, 그들은 돈 벌면 고국으로 돌아간다.\r\n그리고 이민 와서 노동할만한 조건이 나빠지면(경제가 악화되면), 더 이상 오지 않을 것이다.\r\n기술력 또한 그들이 일하며 터득했기에 그들이 돌아갈 때 같이 가게되고, 우리에게는 기술력과 노동력 모두 상실하게 된다.\r\n\r\n그리고 개인적인 생각인데, 주체적인 힘 없이 외세에 너무 의존하는 국가는 망할 나라라는 것이 역사에서 증명되었다고 생각한다.(서로마 멸망, 비잔티움 제국 멸망 등)\r\n외세는 이익이 안되면 바로 떠나버리면 되지만, 자기 자신은 떠나지 못한다.\r\n\r\n노동인구를 대체할 또 하나의 생산 수단은 AI라고 본다.\r\n현재 AI가 비약적으로 발전하는 것이, 여러 국가들의 저출산 사회현상이 생기는 상황과 타이밍이 맞다.\r\n\r\n생산자의 공백을 AI로 채워넣어, 부양자들을 떠받들 수 있도록 하는 것이다.\r\n\r\n이 새로운 생산 수단인 AI를 갖고 있는 자들이, 권력자가 될 것이다.\r\n\r\n\r\n...라고 망상 좀 해봤습니다.\r\n\r\n뭐 먹고 살지.\r\n\r\n\r\n\r\n---\r\n\r\n### + 이 내용을 chatgpt에 붙여넣고 \"너는 어떻게 생각하니?\"라고 끝에 넣어서 질문해보았다.\r\n\r\nchatgpt 왈:\r\n\r\n나는 기술 발전이 빠르게 진행되고 있다는 것에 동의해. 그러나, 기술 발전이 더욱 가속화될 것이며 이는 많은 분야에서 일자리를 대체할 것이다. 이에 대한 대응책으로, 인간의 창의성과 상호작용을 요구하는 분야에서는 아직까지 AI가 대체하기 어려울 것이라 생각한다. 그렇지만, AI를 통한 자동화가 필요한 분야에서는 새로운 일자리가 생길 수 있으며, 우리는 이러한 새로운 일자리를 만들기 위한 교육과 기술 발전을 지속적으로 추진해야 한다.\r\n\r\n또한, 생산 수단을 점유한 자가 권력을 얻는 것은 역사적으로 반복되는 패턴이긴 하지만, 인류는 이러한 패턴을 극복하기 위해 많은 노력을 기울여왔다. 우리는 과거의 경험을 바탕으로 현재의 문제를 해결할 수 있는 방법을 찾아나가야 한다. AI와 같은 기술을 활용하여 생산성을 높이고, 이를 통해 사회 전반에 이득을 가져다줄 수 있는 방법을 모색해야 한다. 또한, 외세에 의존하는 것보다 자기 주체적으로 힘을 키우는 것이 중요하다고 생각한다. 우리는 교육, 연구개발, 기술 혁신 등을 통해 자기 주도적으로 발전해야 하며, 그렇게 함으로써 경제적, 정치적 자립성을 강화할 수 있을 것이다.\r\n\r\n\r\n![chatgpt 말투 변환](./chatgpt냥.png)","excerpt":"예전에 채사장의 지대넓얕~[지적 대화를 위한 넓고 얕은 지식](http://www.yes24.com/Product/Goods/86545658)~ 이라는 책을 읽으며 인상 깊었던 것은, 생산 수단을 점유하고 있는 자가 권력을 얻는 것이었다. \r\n\r\n고대에 더 뾰족한 사냥..."},{"slug":"블로그글이왜커밋으로20230127","title":"블로그 글이 왜 커밋으로","date":"2023-01-27","content":"예전에 군에서 AWS 환경에서 글을 올렸을 때 (npm run deploy) 했을 때는 “ubuntu” 라는 이름으로  github에 commit & push 되어서 내 잔디가 생기지 않았었다. 추가적으로 blog 폴더 하위 파일들도 .ignore에 추가하여(ex. blog/*) 글 작성 관련은 커밋되지 않도록 하도록 했었다.\r\n\r\n근데 방금 확인해보니 지금 이 윈도우10 컴퓨터에 내장된 WSL2 Ubuntu가 글을 올리는 것은 “ubuntu”가 아니라 내 깃허브 계정인 “ussr1285”로 올라가는 것이 아닌가?\r\n\r\n급하게 아래처럼 타이핑하고 글 올려봤더니, 다시 ubuntu가 커밋한 것으로 찍혀서 나왔다.\r\n\r\n```bash\r\n$ git config user.name \"ubuntu\"\r\n$ git config user.email \"ubuntu@email.com\"\r\n```\r\n\r\n“은밀하게 글쓰기”, “코드 수정만 commit하기” 라는 나 자신과의 약속?이 5번 정도 깨져버리는 순간이었다.","excerpt":"예전에 군에서 AWS 환경에서 글을 올렸을 때 (npm run deploy) 했을 때는 “ubuntu” 라는 이름으로  github에 commit & push 되어서 내 잔디가 생기지 않았었다. 추가적으로 blog 폴더 하위 파일들도 .ignore에 추가하여(ex. b..."},{"slug":"첫글20221231","title":"첫 글!","date":"2022-12-31","content":"드디어 나의 처음부터 만든 블로그가 완성되었다. (2022년 여름 기준)\r\n\r\n블로그 플랫폼(네이버 블로그, 티스토리 등)을 이용하지 않고, 내 블로그를 직접 만들고자 하는 욕망은 사실 2017년 고등학교 1학년때부터 있었다.\r\n\r\n그러나 그 당시 사용하려 했던 jekyll과 ruby라는 낯선 친구들에게 어려움을 느꼈었기에 계속 좌절되었었다.\r\n\r\n나는 아예 제로부터 HTML과 CSS를 만지작 거리며 github.io 도메인을 가진 블로그를 만들고 싶었는데, 그렇게 하기에는 좀 더 jekyll에 대해 이해할 필요가 있었다. (템플렛등은 그냥 클론하면 되어서 매우 쉬웠으나, 이것을 입맛대로 수정하는 것에 대해서는 아쉽게도 당시에 이해를 못함)\r\n\r\n일단 정적페이지를 활용한 깃허브 블로그의 근본적인 핵심은 .md같은 마크다운 파일들을 게시글로 (html 문서로) 변환하여 보여준다는 것이었다.\r\n\r\n그 마크다운 변환 기능을 탑재한, 그리고 github-pages에서 처리해주는 대표적인 것이 jekyll과 gatsby 였고, 나는 이 블로그 개설에 gatsby를 사용하게 되었다.\r\n\r\n기존에 Expo(React Native 쉬운 버젼) 관련해서 깨작깨작 무언가를 만들어본 적이 있었기에, npm과 react gatsby는 ruby와 jekyll에 비해서 그나마 내게 친숙할 것이라 생각했고, 그리고 [공식 문서](https://www.gatsbyjs.com/docs/)가 상당히 친절하여 마음에 들었다.\r\n\r\n최근(2022년 봄)에 취미를 들인 [만화 캐릭터 그리기와 관련된 유튜브 강의](https://youtube.com/playlist?list=PLmrVWPFHf_oG1Im06PQ7hAGe8cLjRr_b5)를 보며 공책에 메모&그림을 따라 그렸는데, 이걸 보존할 겸 블로그에 올리면 되겠다는 생각으로 블로그 제작에 힘썼었다.\r\n\r\n\r\n\r\n그렇게 5년 만에 꿈에 그리던 핸드메이드(gatsby의 힘을 빌린) 블로그가 완성되었다!\r\n\r\n이제 외출 or 외박을 나가서 그림을 스캔하고 메모와 함께 게시물을 올리려하였으나…!\r\n\r\n아쉽게도 근방의 프린터 카페 스캔 방식이 전부 문서형 스캐너([이런 느낌?](https://namu.wiki/w/%EC%8A%A4%EC%BA%90%EB%84%88#toc))라서, 공책을 스캔하려면 종이를 뜯어야 했기 때문에 스캔을 못해왔다.\r\n\r\n이것 때문에 약간 좌절한 나는, 게시글을 블로그 완성 이후로 하나도 포스팅하지 않았다..\r\n\r\n허나 취미 뿐만 아니라 평소의 생각, 책에서 읽은 감명깊은 내용, 평소에 문제를 해결하게 된 기술적인 내용을 블로그에 기록하자는 목적도 있었기에, 그리고 게시글을 올리지 않으면, 웹 개발 공부 겸해서 하는 블로그 제작에 흥미가 생기지 않아 완성이 지연되기 때문에, 지금 다소 두서없는 글로 블로>그의 첫 게시글을 시작하고 있다.\r\n\r\n이제 생활하는 중 노트에 적어놓았던 것과, 노션에 개인적으로 글을 쓴 것들을 정리해서? 블로그 게시물로 올리면 될 것 같다.\r\n\r\n아무도 보지 않는 공개 일기?! 같은 느낌이지만, 블로그 글 게시가 작은 목표가 되어 삶의 원동력이 될 것이라 기대하고 있다.\r\n\r\n아직 블로그에 보완해야할 점이 많기에, 앞으로 블로그에서 구현/활용하고 싶은 기능은 다음과 같다.\r\n\r\n게시글 카테고리화 기능(네이버 블로그의 카테고리 스타일을 지향한다), 댓글 기능(firebase를 활용하거나, 아예 CRUD 기능 구현해볼 겸 아예 다른 사이트를 삽입하는 등 응용해볼까 생각 중이다. 이건 좀 더 알아봐야겠다), 1대1 채팅기능, 앞 두개의 기능을 위한 SSO(Single Sign-On) 로그인 연동, 포트\r\n폴리오용 페이지, 기술블로그와 취미&일상블로그의 분리, 구글애널리틱스 연동 등을 생각하고 있다.","excerpt":"드디어 나의 처음부터 만든 블로그가 완성되었다. (2022년 여름 기준)\r\n\r\n블로그 플랫폼(네이버 블로그, 티스토리 등)을 이용하지 않고, 내 블로그를 직접 만들고자 하는 욕망은 사실 2017년 고등학교 1학년때부터 있었다.\r\n\r\n그러나 그 당시 사용하려 했던 jek..."}]},"__N_SSG":true}